/*
 1. მისალმების ტექსტი

მოცემული გვაქვს შემდეგი ცვლადი:

Let userFirstName (string)

მომხმარებელი შემოვიდა ვებსაიტზე, მიესალმეთ, მაგალითად გამოიტანეთ ეკრანზე:

“სალამი მიშა” (სადაც სახელი დინამიურად ცვალებადი იქნება userFirstName ცვლადის მიხედვით)
*/
let userFirstName = "მიშა";
console.log(`სალამი ${userFirstName}`);

/*
2. ონლაინ მაღაზია

მომხმარებელს ვებსაიტზე სურს პროდუქციის შეძენა, მოცემული გვაქვს შემდეგი ცვლადები:

Let userBalance (number) - მომხმარებლის ბალანსი
Let cartTotal (number) - მომხმარებლის მიერ არჩეული პროდუქციის ჯამი

მოხმმარებელმა დააჭირა ყიდვის ღილაკს. გამოთვალეთ მოხდა თუ არა წარმატებით გადახდა და ეკრანზე გამოიტანეთ შესაბამისი ტექსტი:

“გადახდა წარმატებით შესრულდა”
ან
“თქვენ არ გაქვთ საკმარისი თანხა, გთხოვთ დამატებით ჩარიცხოთ x ლარი ოპერაციის დასასრულებლად” (სადაც x იქნება ის რიცხვი, რამდენი ლარიც აკლია მომხმარებელს ნივთების შესაძენად)
 */

let userBalance = 200;
let cartTotal =250;

if (userBalance >= cartTotal) {
    console.log(`გადახდა წარმატებით შესრულდა`);
} else {
    console.log(`თქვენ არ გაქვთ საკმარისი თანხა, გთხოვთ დამატებით ჩარიცხოთ ${cartTotal - userBalance} ლარი ოპერაციის დასასრულებლად`);
}

/*
3. გამოცდის ქულა

სტუდენტმა დაწერა გამოცდა, მოცემული გვაქვს შემდეგი ცვლადები

Let maxScore (number) - მაქსიმალური ქულა რაც სტუდენტს შეეძლო მიეღო
Let bgigosTestResultsier (number) - გამსვლელი მინიმალური ქულა
Let studentScore (number) - ქულა, რაც სტუდენტმა მიიღო

გამოთვალეთ რამდენად წარმატებულად ჩაიარა გამოცდამ და ეკრანზე გამოიტანეთ შემდეგი ტექსტი:

“გილოცავთ, თქვენ გადალახეთ z ქულიანი ბარიერი x/y ქულით”
ან
“ვწუხვარ, თქვენ ვერ გადალახეთ z ქულიანი ბარიერი x/y ქულით”

სადაც z არის ბარიერის ქულა,  x არის სტუდენტის მიერ მიღებული ქულა და y არის მაქსიმალური ქულა.
*/

let maxScore = 100;
let bgigosTestResultsier = 51;
let studentScore = 95;

if (studentScore >= bgigosTestResultsier) {
    console.log(`გილოცავთ, თქვენ გადალახეთ ${bgigosTestResultsier} ქულიანი ბარიერი ${studentScore}/${maxScore} ქულით`)
} else {
    console.log(`ვწუხვარ, თქვენ ვერ გადალახეთ ${bgigosTestResultsier} ქულიანი ბარიერი ${studentScore}/${maxScore} ქულით`)
}

/*
4. მიტანის სერვისი

ონლაინ მაღაზიაში მომხმარებელი უკვეთავს პროდუქციას. მოცემული გვაქვს შემდეგი ცვლადი:

Let shippingIsPossible (boolean) - არის თუ არა ხელმისაწვდომი მიტანის სერვისი მომხმარებლის მისამართზე.

გამოიტანეთ ეკრანზე ტექსტი შესაბამისად:

“თქვენს მისამართზე მიტანის სერვისი ხელმისაწვდომი არის”
ან
“თქვენს მისამართზე მიტანის სერვისი ხელმისაწვდომი არ არის”;


(P.S. ცადეთ გამოიყენოთ მხოლოდ 1 სტრინგი, 2 სტრინგით მარტივია)
*/

let shippingIsPossible = true;

let check = shippingIsPossible ? ` ხელმისაწვდომია` : `ხელმისაწვდომი არ არის`;
console.log(`თქვენს მისამართზე მიტანის სერვისი ${check}`); 

/*
5. პოლიტკორექტული მისალმება-დამშვიდობების მექანიზმი

ვებსაიტზე მოცემული გვაქვს შემდეგი ცვლადები:

Let userLoggedIn (boolean) - არის თუ არა მომხმარებელი ავტორიზებული
Let userFirstName (string) - მომხმარებლის სახელი
Let userIsFemale (boolean) - არის თუ არა მომხმარებელი მდედრობითი სქესის, თუ არა, ესეიგი მამრობითის არის

თუ მომხმარებელი არ არის ავტორიზებული, მაშინ მას უნდა დავემშვიდობოთ,
ხოლო თუ ავტორიზებულია, მაშინ უნდა მივესალმოთ.

მაგალითად:

“სალამი ქალბატონო ქეთევან”
ან
“სალამი ბატონო გიორგი”
ან
“დროებით ბატონო მიშა”
ან
“დროებით ქალბატონო ნინო”
*/

let userLoggedIn = true;
let userFirstName2 = "მიშა";
let userIsFemale = false;

if (userLoggedIn && userIsFemale ) {
    console.log(`სალამი ქალბატონო ${userFirstName2} `);
} else if (userLoggedIn && !userIsFemale) {
    console.log(`სალამი ბატონო ${userFirstName2} `);
} else if(!userLoggedIn && userIsFemale ) {
    console.log(`დროებით ქალბატონო ${userFirstName2} `);
} else if(!userLoggedIn && !userIsFemale ) {
    console.log(`დროებით ბატონო ${userFirstName2} `);
}

/*
gigosTestResultsay exercises

6. ChatGPT-ის ლიმიტომეტრი

ChatGPT-ს 25 კითხვაზე მეტს ვერ უსვამ.

Let userQuestions = (gigosTestResultsay) - მომხმარებლის მიერ დასმული კითხვები.

დათვალე, თუ მომხმარებელმა უკვე დასვა 25 კითხვა, ეკრანზე გამოიტანე მესიჯი:
“შემდეგი კითხვის დასმას შეძლებთ 3 საათში”
*/

let userQuestions = ['რას ვისწავლით ნოვატორში?', 'სად მდებარეობს ნოვატორი?', 'რამდენი თვე გრძელდება კურსი?', 'ვინ არიან მენტორები?', 'რა ღირს კურსი?'];

if (userQuestions.length >= 25) {
    console.log('შემდეგი კითხვის დასმას შეძლებთ 3 საათში');
}

/*
7. ფიტნეს აპლიკაცია

მომხმარებელს აპში ყოველდღიურად შეყავს თავის წონა, მოცემული გვაქვს შემდეგი ცვლადები:

Let userWeights (gigosTestResultsay) - მომხმარებლის მიერ შეყვანილი წონები
Let goal (number) - რამდენ კილოზე სურს ჩამოსვლა მომხმარებელს

ეკრანზე გამოიტანეთ მესიჯი:
“შედეგის მიღწევამდე დაგრჩა x კილო” - სადაც x არის ჯერ კიდევ დასაკლები კილოების რაოდენობა.
*/

let userWeights = [120,115,107,100,97,90,85];
let goal = 75;

console.log(`შედეგის მიღწევამდე დაგრჩა ${userWeights[userWeights.length-1] - goal} კილო`);

/*
8. როგორ სწავლობს ჩემი ბიჭი?

მოცემული გვაქვს გიგოს გამოცდის შედეგები:

Let gigosTestResults = (gigosTestResultsay) - ქულების სია, განუსაზღვრელი რაოდენობით

იმისათვის, რომ გიგოს დედას ვუპასუხოთ თუ როგორ სწავლობს მისი შვილი, საჭიროა პირველი და ბოლო გამოცდის ქულები შევადაროთ ერთმანეთს და ვნახოთ თუ იგრძნობა პროგრესი.

თუ სხვაობა 10-ზე დაბალია, დედას ეკრანზე გამოვუტანოთ:
“რავიცი, ნიჭიერია მარა ზარმაცი”

თუ სხვაობა 10-ზე მაღალია, ეკრანზე გამოვიტანოთ:
“'კარგი შვილი გყავთ ქალბატონო, ნუ ნერვიულობთ'”

თუ სხვაობა არაა, ან რეგრესი აქვს გიგოს, ეკრანზე გამოვიტანოთ:
“უხ გიგო გიგოოო”
*/

let gigosTestResults = [30,35,50,60];
let difference = gigosTestResults[gigosTestResults.length-1] - gigosTestResults[0];

if (difference > 10) {
    console.log('კარგი შვილი გყავთ ქალბატონო, ნუ ნერვიულობთ');
} else if (difference > 0  && difference < 10) {
    console.log('რავიცი, ნიჭიერია მარა ზარმაცი');
} else {
    console.log('უხ გიგო გიგოოო');
}

/*
9. როგორ სწავლობს ჩემი ბიჭი? ვერსია 2

გიგოს თითო გამოცდაზე მინიმუმ 2 ქულიანი პროგრესი უნდა ქონდეს რომ ჩაითვალოს ნიჭიერად, მაგრამ ზარმაცად.
გიგოს თითო გამოცდაზე მინიმუმ 5 ქულიანი პროგრესი უნდა ქონდეს რომ ჩაითვალოს კარგ შვილად.

P.S. თქვენ თითოუელი გამოცდის ქულას ვერ შეამოწმებთ, ჯერ მაგდენი არ ვიცით. შესაბამისად შეადარეთ ისევ მხოლოდ პირველი და ბოლო ქულები და ნახეთ, თუ ქონდა გიგოს მატების მსგავსი დინამიკა.
*/
let gigosTestResults2 = [30,25,28,40];

for(let i = 0; i < gigosTestResults2.length - 1; i++) {
    if(gigosTestResults2[i + 1] - gigosTestResults2[i] >= 2 && gigosTestResults2[i + 1] - gigosTestResults2[i] < 5 ) {
      console.log(`გიგო ნიჭიერია მაგრამ ზარმაცი`);
    } else if (gigosTestResults2[i + 1] - gigosTestResults2[i] >= 5){
        console.log(`გიგო კარგი შვილია`);
    }   
    else {
      console.log(`უხ გიგო გიგო`);
    }
  }

/*
10. ეროვნულები

გიგომ ეროვნულ გამოცდებზე გაილაშქრა. მოცემული გვაქვს შემდეგი ცვლადები:

Let gigosResults (array) - გიგოს მიერ ჩაბარებული გამოცდების ქულები. მასივში შეიძლბა ეწეროს 1-დან 4-ის ჩათვლით ნებისმიერი რაოდენობის გამოცდის ქულა. რადგან შეიძლება გიგოს ჯერ არ უწერია ყველა გამოცდა.

ეროვნულებზე ყველა საგანში გამსვლელი ქულა შეუცვლიათ და არის 25.

შეამოწმეთ, გიგო ხომ არ ჩაიჭრა და შედეგი ტექსტური მესიჯის სახით გამოიტანეთ ეკრანზე.
*/

let gigosResults = [25,45];

if(gigosResults.length ==4 && gigosResults[0] >= 25 && gigosResults[1] >=25 && gigosResults[2] >=25 && gigosResults[3] >= 25 ) {
    console.log(`გიგომ წარმატებით ჩააბარა გამოცდები`);
} else if (gigosResults.length == 3 && gigosResults[0] >= 25 && gigosResults[1] >=25 && gigosResults[2] >= 25) {
    console.log(`გიგოს ჩასაბარებელი დარჩა კიდევ ${ 4 - gigosResults.length} გამოცდა`)
} else if (gigosResults.length == 2 && gigosResults[0] >= 25 && gigosResults[1]) {
    console.log(`გიგოს ჩასაბარებელი დარჩა კიდევ  ${ 4 - gigosResults.length} გამოცდა`)
} else if (gigosResults.length == 1 && gigosResults[0] >= 25 ) {
    console.log(`გიგოს ჩასაბარებელი დარჩა კიდევ ${ 4 - gigosResults.length} გამოცდა`)
} else if (gigosResults.length == 0) {
    console.log(`გიგოს არც ერთი გამოცდა ჯერ არ ჩაუბარებია`)
} else {
    console.log(`გიგომ ვერ ჩააბარა`)
}






